taskt/Core/Automation/Commands/LoopGroup/BeginLoopForDataTableColumnAsDataTableCommand.dot
digraph "BeginLoopForDataTableColumnAsDataTableCommand" {
"BeginLoopForDataTableColumnAsDataTableCommand" -> "ADataTableGetFromDataTableCommands";
"BeginLoopForDataTableColumnAsDataTableCommand" -> "IHaveLoopAdditionalCommands";
"ADataTableGetFromDataTableCommands" -> "ADataTableInputDataTableCommands";
"ADataTableGetFromDataTableCommands" -> "IDataTableGetFromDataTable";
"ADataTableInputDataTableCommands" -> "ScriptCommand";
"ADataTableInputDataTableCommands" -> "IDataTableProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
