taskt/Core/Automation/Commands/LoopGroup/BeginLoopForDataTableColumnAsDataTableCommand.puml
@startuml
BeginLoopForDataTableColumnAsDataTableCommand --> ADataTableGetFromDataTableCommands
BeginLoopForDataTableColumnAsDataTableCommand --> IHaveLoopAdditionalCommands
ADataTableGetFromDataTableCommands --> ADataTableInputDataTableCommands
ADataTableGetFromDataTableCommands --> IDataTableGetFromDataTable
ADataTableInputDataTableCommands --> ScriptCommand
ADataTableInputDataTableCommands --> IDataTableProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
